RouNNdeL/esp8266-leds/src/main.cpp
    convert_all_frames();

    save_globals(&globals);
    save_profile(&current_profile, 0);
    convert_color();
}

void setup()
{
#if SERIAL_DEBUG
    Serial.begin(115200);

    Serial.println("");
    Serial.println("|---------------------------|");
    Serial.println("|------ Begin Startup ------|");
    Serial.println("| LED Controller by RouNdeL |");
    Serial.println("|---------------------------|");

    Serial.println("Version Name: " + String(VERSION_NAME));
    Serial.println("Version Code: " + String(VERSION_CODE));
    Serial.println("Build Date: " + BUILD_DATE);
    Serial.println("Device Id: " + String(DEVICE_ID));
#endif /* SERIAL_DEBUG */

    EEPROM.begin(SPI_FLASH_SEC_SIZE);
    if(ESP.getResetInfoPtr()->reason == REASON_EXCEPTION_RST)
    {
        increase_reset_count();
        if(get_reset_count() > RECOVERY_ATTEMPTS)
        {
            flags |= FLAG_HALT;
        }
        else
        {
            recover();
        }
    }
    else
    {
        eeprom_init();
        set_reset_count(0);
    }

    if(not_halt())
    {
        strip.begin();
        setStripStatus(COLOR_RED);
    }

    WiFiManager manager;
#if !SERIAL_DEBUG
    manager.setDebugOutput(0);
#endif /* SERIAL_DEBUG */
    manager.setAPCallback(configModeCallback);
    manager.setAPStaticIPConfig(IPAddress(192, 168, 1, 1), IPAddress(192, 168, 1, 1), IPAddress(255, 255, 255, 0));
    manager.setConfigPortalTimeout(300);
    manager.autoConnect(AP_NAME);

    if(not_halt() && checkUpdate() == HTTP_CODE_OK) update(1);

#if SERIAL_DEBUG
    Serial.println("|---------------------------|");
    Serial.println("|------- Start LEDs --------|");
    Serial.println("|---------------------------|");
#endif /* SERIAL_DEBUG */

#if PAGE_DEBUG
    server.on("/debug", debug_info);
#endif /* PAGE_DEBUG */

    WiFi.onStationModeDisconnected(on_disconnected);

    if(not_halt())
    {
        server.on("/", handle_root);
        server.on("/restart", restart);
        server.on("/config", redirect_to_config);
        server.on("/globals", receive_globals);
        server.on("/profile", receive_profile);
        server.on("/api", send_json);
        server.on("/update", manual_update_check);
        server.on("/apply_update", apply_update);

        const char *headers[] = {"x-Request-Id"};
        size_t headers_size = sizeof(headers) / sizeof(char *);
        server.collectHeaders(headers, headers_size);

        server.begin();
        user_init();
    }
    else
    {
        sendDeviceHalted();
    }

    ArduinoOTA.begin();
}

void loop()
{
    ArduinoOTA.handle();

    if(halt())
        return;
    /* We do not want the transition to lag, so we don't handle the client */
    if(!(flags & FLAG_TRANSITION) || flags & FLAG_QUICK_TRANSITION)
    {
        server.handleClient();
    }

    if(flags & FLAG_NEW_FRAME)
    {
        flags &= ~FLAG_NEW_FRAME;
        uint8 enabled = 0;

        led_count_t virtual_led_offset = 0;
        for(uint8_t d = 0; d < DEVICE_COUNT; ++d)
        {
            uint8_t *p = strip.getPixels() + virtual_led_offset * 3;
            if(globals.flags[d] & GLOBALS_FLAG_ENABLED | flags & FLAG_TRANSITION)
            {
                enabled = 1;
                if(globals.flags[d] & GLOBALS_FLAG_EFFECTS)
                {

                    device_profile &device = current_profile.devices[d];
                    digital_effect((effect) device.effect, p, virtual_devices[d], 0, frame + frames[d][TIME_DELAY],
                                   frames[d], device.args, device.colors, device.color_count, device.color_cycles);


                    for(uint8_t i = 0; i < virtual_devices[d]; ++i)
                    {
                        uint8_t index = i * 3;
                        set_color_manual(p + index, color_brightness(globals.brightness[d], color_from_buf(p + index)));
                        p[index] = actual_brightness(p[index]);
                        p[index + 1] = actual_brightness(p[index + 1]);
                        p[index + 2] = actual_brightness(p[index + 2]);
                    }

                    strip.show();
                }
                else
                {
                    uint8_t index = d * 6;
                    uint8_t color[3];
                    cross_fade(color, color_converted + index, 3, 0, transition_frame * UINT8_MAX / transition_frames);
                    color[index] = actual_brightness(color[index]);
                    color[index + 1] = actual_brightness(color[index + 1]);
                    color[index + 2] = actual_brightness(color[index + 2]);
                    for(led_count_t i = 0; i < virtual_devices[d]; ++i)
                    {
                        set_color_manual(p + i * 3, grb(color_from_buf(color)));
                    }
                    strip.show();
                }
            }
            else
            {
                for(led_count_t i = 0; i < LED_COUNT; ++i)
                {
                    set_color_manual(p + i * 3, grb(COLOR_BLACK));
                }
                strip.show();
            }

            virtual_led_offset += virtual_devices[d];
        }


        if(transition_frame >= transition_frames && flags & FLAG_TRANSITION)
        {
            for(uint8_t i = 0; i < DEVICE_COUNT; ++i)
            {
                uint8_t index = i * 6;
                memcpy(color_converted + index + 3, color_converted + index, 3);
            }
            flags &= ~FLAG_TRANSITION;
            if(!(flags & FLAG_QUICK_TRANSITION))
                sendDeviceState();
        }

        if(auto_increment && frame && frame % auto_increment == 0 && enabled && globals.profile_count > 1)
        {
            if(flags & FLAG_PROFILE_UPDATED)
            {
                save_profile(&current_profile, globals.profile_order[globals.n_profile]);
                flags &= ~FLAG_PROFILE_UPDATED;
            }
            increment_profile();
            refresh_profile();
            frame = 0;
        }
    }
}
